Revit 2027 API
HomeCamera Constructor
 Constructs a new copy of the input HomeCamera object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public HomeCamera(
	HomeCamera other
)
Public Sub New (
	other As HomeCamera
)
public:
HomeCamera(
	HomeCamera^ other
)
new :
        other : HomeCamera -> HomeCamera
Parameters
other HomeCamera
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
HomeCamera Class
Autodesk.Revit.DB Namespace